Тип транспорта None марки Chuck может развить скорость 50 км/ч
Тип транспорта Car марки RRR может развить скорость 50 км/ч
Объем топлива увеличен на 100 л и составляет 1099 л
Этой лодкой марки XXX владеет Arkasha
Самолет марки www вмещает в себя 777 людей
Тип транспорта None марки Telega может развить скорость 10 км/ч
Тип транспорта bike марки shkolnik может развить скорость 20 км/ч
Самолет марки Virgin Atlantic вмещает в себя 450 людей
Тип транспорта Car марки BMW может развить скорость 230 км/ч
Осталось бензина 300 л
Объем топлива увеличен на 20 л и составляет 320 л
Осталось бензина 320 л
Ошибка заправки автомобиля
Этой лодкой марки Yamaha владеет Petr