# Перед вами имеется список numbers

# Необходимо компактно вывести все числа из numbers, разбивая цифры на триады, с шириной строки
# в 40 символов

from pprint import pprint


numbers = [14984103875, 5366100145, 20230646264, 16725913326, 6252088594, 22200766796,
           13706995793, 5955815731, 5626670672, 7324174291, 14321638214, 33837482752, 6324548433,
           36295941880, 17309957772, 29938233628, 41998129991, 38528021483, 23049259582,
           25487205389, 42184904367, 11511558152, 26782437748, 8312451238, 18128601468]

pprint(numbers, width=40, underscore_numbers=True, compact=True)
