# Напишите функцию filter_tuples, которая принимает кортеж кортежей из трех числовых значений.
#
# Функция filter_tuples должна вернуть новый кортеж, который состоит только из тех элементов входного кортежа,
# произведение значений которых равно 60
#
# Sample Input 1:
#
# numbers = (
#     (1, 2, 3), (1, 2, 30),
#     (1, 20, 3), (15, 2, 3),
#     (10, 2, 3), (10, 20, 30),
# )
# print(filter_tuples(numbers))
# Sample Output 1:
#
# ((1, 2, 30), (1, 20, 3), (10, 2, 3))
# Sample Input 2:
#
# numbers = (
#     (1, 2, 3), (1, 2, 30),
#     (1, 20, 3), (5, 3, 4),
#     (5, 12, 1), (5, 12, 0),
#     (5, 5, 12), (15, 2, 3),
#     (10, 2, 3), (10, 20, 30),
#     (1, 2, 30), (60, 1, 1),
#     (60, 1, 0), (20, 2, 2),
# )
# print(filter_tuples(numbers))
# Sample Output 2:
#
# ((1, 2, 30), (1, 20, 3), (5, 3, 4), (5, 12, 1), (10, 2, 3), (1, 2, 30), (60, 1, 1))


def filter_tuples(tpl: tuple[tuple[int, int, int]]) -> tuple[tuple[int, int, int]]:
    return tuple(filter(lambda x: x[0] * x[1] * x[2] == 60, tpl))

numbers = (
    (1, 2, 3), (1, 2, 30),
    (1, 20, 3), (5, 3, 4),
    (5, 12, 1), (5, 12, 0),
    (5, 5, 12), (15, 2, 3),
    (10, 2, 3), (10, 20, 30),
    (1, 2, 30), (60, 1, 1),
    (60, 1, 0), (20, 2, 2),
)
print(filter_tuples(numbers))
