# Выведите на экран полные названия всех месяцев по порядку

import calendar

for i in calendar.day_abbr:
    print(i)
