# Поле для игры сапёр представляет собой сетку размером
# n × m
# n×m. В ячейке сетки может находиться или отсутствовать мина.
#
# Напишите программу, которая выводит "решённое" поле, т.е. для каждой ячейки, не являющейся миной, указывается число
# мин, находящихся в соседних ячейках (учитывая диагональные направления)
#
# Формат ввода:
# На первой строке указываются два натуральных числа
#
# 1≤n,m≤100, после чего в n строках содержится описание поля в виде последовательности точек '.' и звёздочек '*', где
# точка означает пустую ячейку, а звёздочка − ячейку с миной.
#
# Формат вывода:
# n
# n строк поля, в каждой ячейке которого будет либо число от 0 до 8, либо мина (обозначенная символом "*"), при этом
# число означает количество мин в соседних ячейках поля.
#
# Sample Input:
#
# 4 4
# ..*.
# **..
# ..*.
# ....
# Sample Output:
#
# 23*1
# **32
# 23*1
# 0111
import copy

a, b = 4, 4  # list(map(int,input().split()))
print(a, b)

matrix_org = [['.', '.', '*', '.'], ['*', '*', '.', '.'], ['.', '.', '*', '.'],
              ['.', '.', '.', '.']]  # [list(input()) for _ in range(a)]
matrix = copy.deepcopy(matrix_org)
cnt = 0
for ln in range(len(matrix)):
    for cl in range(b):
        if ln == 0:
            if cl == 0:
                if matrix[ln][cl] == '.':
                    if matrix[ln + 1][cl] == '*':
                        cnt += 1
                    if matrix[ln + 1][cl + 1] == '*':
                        cnt += 1
                    if matrix[ln][cl + 1] == '*':
                        cnt += 1
                    matrix[ln][cl] = cnt
                    cnt = 0
            if cl == b - 1:
                if matrix[ln][cl] == '.':
                    if matrix[ln + 1][cl] == '*':
                        cnt += 1
                    if matrix[ln + 1][cl - 1] == '*':
                        cnt += 1
                    if matrix[ln][cl - 1] == '*':
                        cnt += 1
                    matrix[ln][cl] = cnt
                    cnt = 0
            else:
                if matrix[ln][cl] == '.':
                    if matrix[ln + 1][cl] == '*':
                        cnt += 1
                    if matrix[ln + 1][cl + 1] == '*':
                        cnt += 1
                    if matrix[ln][cl + 1] == '*':
                        cnt += 1
                    matrix[ln][cl] = cnt
                    if matrix[ln + 1][cl - 1] == '*':
                        cnt += 1
                    if matrix[ln][cl - 1] == '*':
                        cnt += 1
                    cnt = 0

print(matrix)
